renesas/ra-fsp-examples/example_projects/ek_ra8e2/_quickstart/quickstart_ek_ra8e2_ep/e2studio/src/menu_ext.c
/*
* Copyright (c) 2020 - 2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
*/
/**********************************************************************************************************************
 * File Name    : menu_ext.c
 * Version      : 1.0
 * Description  : Memory demo. Manages demo interface to console and lcd.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * History : DD.MM.YYYY Version  Description
 *         : 01.01.2025 1.00     First Release
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 *********************************************************************************************************************/
#include <stdio.h>
#include <string.h>
#include <stdarg.h>

#include "hal_data.h"
#include "board_cfg.h"
#include "r_typedefs.h"

#include "FreeRTOS.h"
#include "FreeRTOSConfig.h"
#include "semphr.h"
#include "queue.h"
#include "task.h"
#include "bsp_api.h"

#include "common_init.h"
#include "common_data.h"
#include "common_utils.h"
#include "board_hw_cfg.h"
#include "menu_ext.h"
#include "ospi_b_ep.h"

/**********************************************************************************************************************
 Macro definitions
 *********************************************************************************************************************/
/* The RA8P1 OSPI flash is Macronix MX25LW51245G */
/* The device is 512M bit (64M Byte) */

#define GPT_PCLKD_CLOCK_MHZ                     (120)

#define OSPI_TOTAL_TEST_SIZE                    (16 * 1024)
#define OSPI_WEN_BIT_MASK                       (0x02U)
#define OSPI_WIP_BIT_MASK                       (0x01U)
#define OSPI_TEST_PAGE_SIZE                     (512U)
#define OSPI_ERASE_BLOCK_SIZE                   (4096U)

#define WAITING_MESSAGE                         ("Waiting Results")

#define OSPI_START_ADDRESS                      (0x90000000)        /* CS1 */
#define TEST_ADDRESS                            (OSPI_START_ADDRESS + (63 * 1024 * 1024))

#define STATUS_WRITE_ENABLED                    (2)

#define CONNECTION_ABORT_CRTL                   (0x00)
#define MENU_EXIT_CRTL                          (0x20)
#define MENU_ENTER_RESPONSE_CRTL                (0x09)
#define INPUT_BUFFER                            (0x05)
#define CARRAGE_RETURN                          (0x0D)

/* 8m1 WS/ES using basic driver */
#define BLOCK_LIMIT                             (64)

#define FOURKB_LIMIT                            (BLOCK_LIMIT / 4)

#define MODULE_NAME     "\r\n%d. OCTO-SPI SPEED DEMONSTRATION\r\n"

#define SUB_OPTIONS     "\r\nCompares the write and read times to and from external Octo-SPI" \
                        "\r\nflash memory\r\n" \
                        "\r\n> Enter the text block size " \
                        "\r\n(in multiples of 2 KB, max 64 KB) and press tab to continue : "

#define WRITE_ENABLE_MASK                       (0x02U)

#define READ_SFDP_DUMMY_CYCLES                  (8U)
#define SFDP_SIGNATURE                          (0x50444653U)

//#define OSPI_TEST_DATA_LENGTH  (0x30U)
#define OSPI_TEST_DATA_LENGTH                   (0x40U)
#define OSPI_SECTOR_SIZE                        (4096U)
#define OSPI_BLOCK_SIZE                         (262144U)

#define OSPI_RESET_PIN                          (BSP_IO_PORT_01_PIN_06)
#define OSPI_RESET_DELAY                        (200U)

#define MAX_BLOCK_SIZE                          (64 * 1024)

/* Limit test to 4K as UNHYSA bit is set so device in hybrid mode where the first few sectors are 4k blocks. */
#define WRITE_BLOCK_SIZE                        (64)
#define TEST_BLOCKS                             (64)

/**********************************************************************************************************************
 Local Typedef definitions
 *********************************************************************************************************************/
typedef struct st_clk_settings
{
    cgc_pll_cfg_t pll;
    bsp_clocks_octaclk_div_t div;
} clk_settings_t;

const char_t test_data[64] = "Mary had a little lamb, and some other waffle that takes line 2";

/**********************************************************************************************************************
 Exported global variables
 *********************************************************************************************************************/
/* Block in RAM for performance measurement */
static uint8_t s_read_block[MAX_BLOCK_SIZE];

/**********************************************************************************************************************
 Private (static) variables and functions
 *********************************************************************************************************************/
static void wait_for_write(void);
void ospi_performance_test(uint32_t data_size, uint32_t *ospi_performance_write_result,
        uint32_t *ospi_performance_read_result);
void clear_console(void);
static uint32_t validate_user_input(char_t *p_input);
static fsp_err_t write_test_opi(uint32_t num_blocks);
static fsp_err_t read_test_opi(uint32_t block_size);

static uint8_t *const gp_ospi_cs1 = (uint8_t *) TEST_ADDRESS;

#ifndef USE_TINY_TEST
static uint8_t g_test_data[OSPI_TEST_DATA_LENGTH] = "";
#else
static uint8_t  g_test_data[OSPI_TEST_DATA_LENGTH] =
{
    0x00, 0x00, 0xFF, 0xFF, 0xFF, 0x00, 0x08, 0x00, 0x00, 0xF7, 0xFF, 0x00, 0x08, 0xF7, 0x00, 0xF7, // Auto-calibration pattern.
    0x35, 0x35, 0x35, 0x35, 0xBD, 0xFF, 0xEE, 0xF1, 0x36, 0x36, 0x36, 0x36, 0xBC, 0xFF, 0xEF, 0xF2,
    0x37, 0x37, 0x37, 0x37, 0xBF, 0x01, 0xEE, 0xF1, 0x38, 0x38, 0x38, 0x38, 0xBA, 0x1F, 0x6F, 0xF3,
    0xA5, 0xA5, 0xA5, 0xA5, 0x5A, 0x5A, 0x5A, 0x5A, 0x5A, 0x00, 0x00, 0x00, 0x00, 0x00, 0xFF, 0xFF,
};
#endif

static uint32_t s_test_remain           = WRITE_BLOCK_SIZE;
static uint32_t s_test_current_block    = 0;
static uint32_t s_test_current_sub      = 0;
static size_t   s_data_size             = TEST_BLOCKS * WRITE_BLOCK_SIZE;

/* Each thread must have a separate print buffer, to avoid clashes on task switching */
static char_t s_print_buffer[BUFFER_LINE_LENGTH] =
{ };

static char_t s_block_sz_str[INPUT_BUFFER] =
{ };

st_rgb565_text_block_page_t g_ext_page =
{
    13, // Number of lines required (including blanks)
    " OCTO-SPI SPEED DEMONSTRATION", /* Title */
    {
       {{PAGE_LEFT_EDGE, LINE(1)  + BLOCK(0)},"INSTRUCTIONS"},
       {{PAGE_LEFT_EDGE, LINE(2)  + BLOCK(0)},"Compares the write and read times to and from external"},
       {{PAGE_LEFT_EDGE, LINE(3)  + BLOCK(0)},"Octo-SPI flash memory."},

       {{PAGE_LEFT_EDGE, LINE(5)  + BLOCK(0)},"Operation/Flash"},
       {{PAGE_1ST_TAB,   LINE(5)  + BLOCK(0)},"Octo-SPI"},
       {{PAGE_LEFT_EDGE, LINE(6)  + BLOCK(0)},"___________________________________________"},
       {{PAGE_LEFT_EDGE, LINE(7)  + BLOCK(0)},"Write"},
       {{PAGE_1ST_TAB,   LINE(7)  + BLOCK(0)},""},
       {{PAGE_LEFT_EDGE, LINE(8)  + BLOCK(0)},"Read"},
       {{PAGE_1ST_TAB,   LINE(8)  + BLOCK(0)},""},
       {{PAGE_LEFT_EDGE, LINE(9)  + BLOCK(0)},""},

       {{PAGE_LEFT_EDGE, LINE(11)  + BLOCK(0)},"NOTE"},
       {{PAGE_LEFT_EDGE, LINE(12) + BLOCK(0)},"Menu & Close icons Disabled"},
    }
};

static clk_settings_t clk_120MHz =
{
    .pll =
    {
        .source_clock = CGC_CLOCK_MAIN_OSC,
        .divider      = BSP_CLOCKS_PLL_DIV_2,
        .multiplier   = BSP_CLOCKS_PLL_MUL(80U, 0U),
        .out_div_p    = CGC_PLL_OUT_DIV_2,
        .out_div_q    = CGC_PLL_OUT_DIV_6, // Not used, set to div / 6 (default)
        .out_div_r    = CGC_PLL_OUT_DIV_6, // Not used, set to div / 6 (default)
    },
    .div = (bsp_clocks_octaclk_div_t) BSP_CLOCKS_OCTA_CLOCK_DIV_4,
};

