renesas/ra-fsp-examples/example_projects/ek_ra8e2/_quickstart/quickstart_ek_ra8e2_ep/e2studio/src/menu_ext.c
/* Block in RAM for performance measurement */
uint8_t read_block[MAX_BLOCK_SIZE];

static uint32_t g_counter = 0;
/***********************************************************************************************************************
 * Global Variables
 **********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: oclk_change
 * Description  : Set the OSPI flash clock frequency
 * @param[in] clk_settings_t const * const clock_settings pointer to clock settings
 * @retval None
 *********************************************************************************************************************/
static void oclk_change(clk_settings_t const * const clock_settings)
{
    g_cgc.p_api->open(g_cgc.p_ctrl, g_cgc.p_cfg);

    /* Stop the restart PLL2 with appropriate configurations */
    assert(FSP_SUCCESS == g_cgc.p_api->clockStop(g_cgc.p_ctrl, CGC_CLOCK_PLL2));
    assert(FSP_SUCCESS == g_cgc.p_api->clockStart(g_cgc.p_ctrl, CGC_CLOCK_PLL2, &clock_settings->pll));

    /* Now update the octaclk divider */
    bsp_octaclk_settings_t octaclk_settings;
    octaclk_settings.source_clock = BSP_CLOCKS_CLOCK_PLL2;
    octaclk_settings.divider      = clock_settings->div;
    R_BSP_OctaclkUpdate(&octaclk_settings);

    g_cgc.p_api->close(g_cgc.p_ctrl);
}
/**********************************************************************************************************************
 * End of function oclk_change
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: ospi_performance_test
 * Description  : erase an area of flash, then write to it followed by a read to verify written data
 * Arguments    : data_size
 *              : ospi_performance_write_result
 *              : ospi_performance_read_result
 * Return Value : None
 *********************************************************************************************************************/
void ospi_performance_test(uint32_t data_size, uint32_t *ospi_performance_write_result,
        uint32_t *ospi_performance_read_result)
{
    fsp_err_t err = FSP_SUCCESS;
    uint32_t erase_size = 4096;

    /* OSPI device already opened as it is used for the PLCD graphics */
    err = ospi_b_init();

    /* Clean the OSPI device up before testing */
    err = ospi_b_set_protocol_to_spi ();

    if (FSP_SUCCESS == err)
    {
        for (uint32_t nb = 0; nb < FOURKB_LIMIT; nb++)
        {
            err = g_ospi.p_api->erase(g_ospi.p_ctrl, (uint8_t*) (gp_ospi_cs1 + (erase_size * nb)), erase_size);
            assert(FSP_SUCCESS == err);
            wait_for_write ();
        }
    }
    else
    {
        print_to_console("Failed to set device to SPI mode\r\n");
    }

    err = ospi_b_set_protocol_to_opi();

    /* increase the clock frequency to 120MHz */
    oclk_change(&clk_120MHz);

    if (FSP_SUCCESS == err)
    {
        print_to_console("\r\nWriting the text block to external Octo-SPI flash memory ...\r\n");

        err = write_test_opi(data_size / 64);

        *ospi_performance_write_result = g_counter;

        print_to_console("Writing to flash completed\r\n");

        if (FSP_SUCCESS != err)
        {
            print_to_console("Flash write failed\r\n");
        }
    }
    else
    {
        print_to_console("Failed to set device to OPI mode\r\n");
    }

    if (FSP_SUCCESS == err)
    {
        print_to_console ("\r\nReading the text block from external Octo-SPI flash memory ...\r\n");

        err = read_test_opi (data_size / 64);

        *ospi_performance_read_result = g_counter;

        print_to_console("Reading from flash completed\r\n");

        if (FSP_SUCCESS != err)
        {
            print_to_console("Flash read / verify failed\r\n");
        }
    }
}
/**********************************************************************************************************************
 End of function ospi_performance_test
 *********************************************************************************************************************/
 
/**********************************************************************************************************************
 * Function Name: ext_display_menu
 * Description  : Implements the external flash memory menu
 * Return Value : 0
 *********************************************************************************************************************/
test_fn ext_display_menu(void)
{
    bool_t   valid_block_size  = false;
    int32_t c = -1;

    uint32_t block_size_actual = 0;
    int32_t  block_sz_ndx      = 0;
    int32_t  block_sz_limit    = (INPUT_BUFFER - 2); /* Allowing for TAB and End of Message */
    uint32_t value             = 0;
    
    char_t res_str[24];

    clear_console();

    sprintf(res_str, WAITING_MESSAGE);

    sprintf(g_ext_page.text_block[7].line, res_str);
    sprintf(g_ext_page.text_block[9].line, res_str);

    sprintf(res_str," ");
    sprintf(g_ext_page.text_block[10].line, res_str);

    dsp_set_background(LCD_FULL_BG_EXTERNAL_MEMORY);

    sprintf (s_print_buffer, MODULE_NAME, g_selected_menu);
    print_to_console(s_print_buffer);
    print_to_console(SUB_OPTIONS);

    /* Keep trying to read a valid text block size
     * complete the loop in one of two ways:
     * [1] Valid block size is entered (2K boundary range 2-64K) followed by TAB
     * [2] Space Bar is pressed at any stage
     */

    while (false == valid_block_size)
    {
        /* Reset input state */
        c = -1;

        block_sz_ndx = 0;
        memset (&s_block_sz_str, 0, INPUT_BUFFER);

        while ((CONNECTION_ABORT_CRTL != c))
        {
            c = input_from_console();

            if ((block_sz_ndx < block_sz_limit) && (BACK_SPACE != c) && (BACK_SPACE_PUTTY != c) && (CARRAGE_RETURN != c)
                    && (MENU_ENTER_RESPONSE_CRTL != c))
            {
                /* Cast to req type */
                s_block_sz_str[block_sz_ndx] = (char_t)c;
                block_sz_ndx++;
            }
            else if (((BACK_SPACE == c) || (BACK_SPACE_PUTTY == c)) && (block_sz_ndx > 0))
            {
                s_block_sz_str[block_sz_ndx - 1] = '\0';
                block_sz_ndx--;
                print_to_console("\b \b");
            }
            else if ((0 == block_sz_ndx) || (CARRAGE_RETURN == c))
            {
                __NOP();
            }
            else
            {
                /* maximum block size exceeded (4 digits / characters entered) */
                s_block_sz_str[block_sz_ndx] = MENU_ENTER_RESPONSE_CRTL;
                c                            = MENU_ENTER_RESPONSE_CRTL;
                break;
            }

            if (MENU_EXIT_CRTL == c)
            {
                /* Abort the test */
                valid_block_size = true;
                block_size_actual = 0;
                break;
            }

            if ((MENU_ENTER_RESPONSE_CRTL == c) || (CARRAGE_RETURN == c))
            {
                break;
            }

            if ((CARRAGE_RETURN != c) && (BACK_SPACE != c))
            {
                sprintf (s_print_buffer, "%c", (char_t) c);
                print_to_console(s_print_buffer);
            }
        }

