renesas/ra-fsp-examples/example_projects/ek_ra8e2/_quickstart/quickstart_ek_ra8e2_ep/e2studio/src/menu_ext.c
        /* If the input was terminated with a TAB then attempt to process it */
        if ((MENU_ENTER_RESPONSE_CRTL == c) || (CARRAGE_RETURN == c))
        {
            value = validate_user_input (&s_block_sz_str[0]);
        }

        vTaskDelay (10);

        if (value < 2)
        {
            value = INVALID_BLOCK_SIZE;
        }

        if ((value > BLOCK_LIMIT) && (value < INVALID_MARKERS))
        {
            value = INVALID_BLOCK_SIZE;
        }

        if ((value > 0) && ((value % 2) != 0) && (value < INVALID_MARKERS))
        {
            value = INVALID_BLOCK_BOUNDARY;
        }

        switch (value)
        {
            case INVALID_CHARACTER:
            {
                print_to_console("\r\n> Invalid character in entry, enter the text block size specifying a 2K boundary"
                         " (e.g. 24) and press tab: ");
                break;
            }

            case INVALID_BLOCK_SIZE:
            {
                print_to_console("\r\n> Invalid size, enter the text block size (e.g. 24) and press tab: ");
                break;
            }

            case INVALID_BLOCK_BOUNDARY:
            {
                print_to_console("\r\n> Invalid boundary, enter the text block size specifying a 2K boundary (e.g. 24)"
                         " and press tab : ");
                break;
            }

            default:
            {
                valid_block_size = true;
            }
        }
    }

    block_size_actual = value;

    if ((MENU_ENTER_RESPONSE_CRTL == c) && (0 != block_size_actual))
    {
        fsp_err_t fsp_err = FSP_SUCCESS;

        uint32_t ospi_performance_write_result = 0;
        uint32_t ospi_performance_read_result = 0;
        uint32_t ospi_read_result = 0;
        uint32_t ospi_write_result = 0;

        sprintf (s_print_buffer, "\r\n\r\nGenerated a text block of %2lu KB in SRAM\r\n", block_size_actual);
        print_to_console(s_print_buffer);

        block_size_actual = block_size_actual * 1024;

        ospi_performance_test (block_size_actual, &ospi_performance_write_result, &ospi_performance_read_result);

        ospi_write_result =  ospi_performance_write_result / GPT_PCLKD_CLOCK_MHZ;
        ospi_read_result  =  ospi_performance_read_result / GPT_PCLKD_CLOCK_MHZ;

        /* Handle error */
        if (FSP_SUCCESS != fsp_err)
        {
            /* Fatal error */
            SYSTEM_ERROR_CFG_
        }

        print_to_console("\r\n-------------------------------------------------");
        print_to_console("\r\nOperation/Flash          Octo-SPI");
        print_to_console("\r\n-------------------------------------------------");

        sprintf (s_print_buffer, "\r\nWrite                    %6ld", ospi_write_result);
        print_to_console(s_print_buffer);

        sprintf (s_print_buffer, "\r\nRead                     %6ld", ospi_read_result);
        print_to_console(s_print_buffer);

        print_to_console("\r\n-------------------------------------------------");
        print_to_console("\r\nNote: Times are in microseconds");
        print_to_console(MENU_RETURN_INFO);

        sprintf(res_str,"%6ld uS", ospi_write_result);
        sprintf(g_ext_page.text_block[7].line, res_str);
        sprintf(res_str,"%6ld uS", ospi_read_result);
        sprintf(g_ext_page.text_block[9].line, res_str);

        sprintf(res_str,"Block Size %6ld Bytes", block_size_actual);
        sprintf(g_ext_page.text_block[10].line, res_str);

    }

    while ((CONNECTION_ABORT_CRTL != c))
    {
        if ((MENU_EXIT_CRTL == c) || (0x00 == c))
        {
            break;
        }

        c = input_from_console ();
    }

    return (0);
}
/**********************************************************************************************************************
 End of function ext_display_menu
 *********************************************************************************************************************/
 
/**********************************************************************************************************************
 * Function Name: clear_console
 * Description  : Send escape codes to clear the console and home the cursor
 * Return Value : None
 *********************************************************************************************************************/
void clear_console(void)
{
    print_to_console("\x1b[2J\x1b[H");
}
/**********************************************************************************************************************
 End of function clear_console
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wait_for_write
 * Description  : Read the status register until it indicates that the write has completed
 * Return Value : None
 *********************************************************************************************************************/
static void wait_for_write(void)
{
    spi_flash_status_t status =
    { 0 };

    do
    {
        assert(FSP_SUCCESS == g_ospi.p_api->statusGet (g_ospi.p_ctrl, &status));
    }
    while (status.write_in_progress);
}
/**********************************************************************************************************************
 End of function wait_for_write
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: write_test_opi
 * Description  : write data to the OSPI flash and use a timer to time the write duration
 * Argument     : num_blocks
 * Return Value : FSP_SUCCESS on success or an error code on failure
 *********************************************************************************************************************/
static fsp_err_t write_test_opi(uint32_t num_blocks)
{
    fsp_err_t err;
    fsp_err_t retval = FSP_SUCCESS;
    timer_status_t timer_status;

    srand(0);
    volatile uint8_t data = (uint8_t) rand();

    R_GPT_Open(g_memory_performance.p_ctrl, g_memory_performance.p_cfg);

    FSP_CRITICAL_SECTION_DEFINE;
    FSP_CRITICAL_SECTION_ENTER;

    /* Write the test data in OPI mode */
    g_counter = 0;

    for (s_test_current_block = 0; s_test_current_block < num_blocks; s_test_current_block++)
    {
        s_test_remain = WRITE_BLOCK_SIZE;
        s_test_current_sub = 0;

        while (s_test_remain > 0)
        {
            s_test_remain--;
            data = (uint8_t) rand();
            g_test_data[s_test_current_sub++] = data;
        }

        /* Only Time the write function that includes the wait_for_write */
        R_GPT_Start(g_memory_performance.p_ctrl);

        err = g_ospi.p_api->write (g_ospi.p_ctrl, (g_test_data),
                                    (uint8_t *) (gp_ospi_cs1 + (s_test_current_block * WRITE_BLOCK_SIZE)),
                                    WRITE_BLOCK_SIZE);

        wait_for_write();

        R_GPT_Stop(g_memory_performance.p_ctrl);
        R_GPT_StatusGet(g_memory_performance.p_ctrl, &timer_status);

        if (err != FSP_SUCCESS)
        {
            retval = err;
        }

