renesas/ra-fsp-examples/example_projects/ek_ra8e2/_quickstart/quickstart_ek_ra8e2_ep/e2studio/src/menu_ext.c
        /* Dummy delay */
        R_BSP_SoftwareDelay(20, BSP_DELAY_UNITS_MICROSECONDS);
    }
    FSP_CRITICAL_SECTION_EXIT;

    R_GPT_StatusGet(g_memory_performance.p_ctrl, &timer_status);
    g_counter= timer_status.counter;

    R_GPT_Close(g_memory_performance.p_ctrl);

    if (retval != FSP_SUCCESS)
    {
        print_to_console("Write failed");
    }

    return (retval);
}
/**********************************************************************************************************************
 End of function write_test_opi
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: read_test_opi
 * Description  : read data from the OSPI flash and use a timer to time the read duration
 * Argument     : block_size - the size of the block to read
 * Return Value : FSP_SUCCESS on success or an error code on failure
 *********************************************************************************************************************/
static fsp_err_t read_test_opi(uint32_t block_size)
{
    fsp_err_t err = FSP_SUCCESS;
    timer_status_t timer_status;
    uint32_t failing_index = 0;
    uint8_t *ptr;

    srand(0);
    volatile uint8_t data = (uint8_t) rand();
    volatile uint32_t errors = 0;

    /* Upscale block_size to bytes by multiply by 64 */
    block_size *= 64;

    s_data_size = TEST_BLOCKS * WRITE_BLOCK_SIZE;

    err = R_GPT_Open(g_memory_performance.p_ctrl, g_memory_performance.p_cfg);

    memset(s_read_block, 0, block_size);

    FSP_CRITICAL_SECTION_DEFINE;
    FSP_CRITICAL_SECTION_ENTER;

    R_GPT_Reset(g_memory_performance.p_ctrl);

    /* Read the data and time the read operation */
    ptr = gp_ospi_cs1;

    err = R_GPT_Start(g_memory_performance.p_ctrl);

    memcpy(s_read_block, ptr, block_size);

    R_GPT_StatusGet(g_memory_performance.p_ctrl, &timer_status);

    g_counter = timer_status.counter;
    FSP_CRITICAL_SECTION_EXIT;

    R_GPT_Close(g_memory_performance.p_ctrl);

    ptr = s_read_block;

    /* Verify data */
    for (uint32_t i = 0; i < block_size; i++)
    {
        data = (uint8_t) rand();

        if (*ptr != data)
        {
            if (errors == 0)
            {
                failing_index = i;
            }

            err = FSP_ERR_INVALID_DATA;
            errors++;
        }

        ptr++;
    }

    if (errors > 0)
    {
        sprintf(s_print_buffer, "Failed to verify %lu bytes. First verification failure index %lu\r\n", errors, failing_index);
        print_to_console(s_print_buffer);
    }

    return (err);
}
/**********************************************************************************************************************
 End of function read_test_opi
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: validate_user_input
 * Description  : parse the user input and convert to integer value
 * Argument     : p_input
 * Return Value : Integer value entered, or 0 if the menu exit character was entered
 *********************************************************************************************************************/
static uint32_t validate_user_input(char_t *p_input)
{
    uint32_t result = INVALID_CHARACTER;
    uint32_t value  = 0;
    uint32_t t      = 0;
    uint32_t c      = 0;

    while (true)
    {
        /* Cast to req type */
        c = (uint32_t) (*p_input);

        p_input++;

        if ((c >= '0') && (c <= '9'))
        {
            /* Cast as compiler will interpret result as int */
            value = (uint32_t) (value * 10);

            /* Cast to req type */
            t = (uint32_t) (c - '0');

            /* Cast as compiler will interpret result as int */
            value = (uint32_t) (value + t);
        }
        else
        {
            if (MENU_ENTER_RESPONSE_CRTL == c)
            {
                result = value;
            }

            if (MENU_EXIT_CRTL == c)
            {
                result = 0;
            }

            break;
        }
    }

    return (result);
}
/**********************************************************************************************************************
 End of function validate_user_input
 *********************************************************************************************************************/
